{
    "articles": [
        "Donald Trump ran on many braggadocios and largely unrealistic campaign promises. One of those promises was to be the best, the hugest, the most competent infrastructure president the United States has ever seen. Trump was going to fix every infrastructure problem in the country and Make America Great Again in the process. That is, unless you’re a brown American. In that case, you’re on your own, even after a massive natural disaster like Hurricane Maria. Puerto Rico’s debt, which the Puerto Rican citizens not in government would have no responsibility for, has nothing to do with using federal emergency disaster funds to save the lives of American citizens there. The infrastructure is certainly a mess at this point after a Category 5 hurricane ripped through the island, and 84 percent of Puerto Rican people are currently without electricity. Emergency efforts after Hurricanes Irma and Harvey reportedly went very well and Trump praised himself as well and even saw his disastrous approval ratings tick up slightly as a result. However, the insufficient response in Puerto Rico has nothing to do with Trump, in his mind, and can only be blamed on the people there who do not live in a red state and have no electoral college votes to offer the new president for 2020. They’re on their own. Twitter responded with sheer incredulity at Trump’s vicious attack on an already suffering people. Featured image screengrab via YouTube",
        "When the Graham-Cassidy bill failed to reach the Senate floor last week, the media wanted to put a stake in the heart of the administration’s agenda, declaring all Obamacare repeal efforts to be dead. For the millions of Americans struggling under the Affordable Care Act regime, however, the fight to make lemonade out of lemons must continue this fall. Luckily, conservatives in Congress who want to see the end of Obamacare and understand the perils of inaction are not giving up. Earlier this week, America Rising Squared, a conservative policy organization which I lead, issued a path forward. We outline five popular conservative actions Congress and the president can take by the end of the year to protect taxpayers and those disproportionately harmed by the ACA while the larger repeal effort remains delayed until next year. The first step is to protect them from new Obamacare taxes coming in January. Americans should be encouraged to know that conservatives in the Senate have introduced legislation to stop the health insurance tax and the medical device tax. Cory Gardner (R-Colo.) and 10 fellow conservative senators, including Ted Cruz (R-Texas) and Ron Johnson (R-Wis.), introduced legislation last week to stop the insurance tax. In the House, a bipartisan effort is underway to do the same, led by Republican Rep. Kristi Noem of South Dakota and Democratic Rep. Kyrsten Sinema of Arizona. These members of Congress understand that Obamacare taxes will harm Americans of all walks of life, and will disproportionately harm seniors and small businesses. In all, if Congress fails to act, the health insurance tax would amount to a new annual $14.3 billion tax increase. Republicans don’t want to see a tax hike go into effect on their watch, and Democrats don’t want to put more of a burden on vulnerable Americans, so action is required now. Second, there should be no bailouts for Obamacare. While bipartisanship is a key to success in getting legislation passed, the president and conservatives in Congress ought to fight back against all efforts to bail out this law. When House Republicans sued President Obama in 2014 over the health-care act's cost-sharing subsidies, a federal judge sided with the plaintiffs, deeming these bailouts unconstitutional. The Obama administration appealed, so today President Trump can easily drop that appeal and end unconstitutional Obamacare cronyism. Liberals in the Senate want new bailouts, but conservatives such as Cruz have warned colleagues that they must oppose any such efforts. The third step needed to cripple the health care law and protect Americans is for President Trump to direct the IRS to weaken the individual mandate and expand the hardship exemptions. The individual mandate has forced many Americans to purchase coverage they do not want and cannot afford, and even candidate Obama admitted in 2008 that under Massachusetts' plan, “there are people who are paying ﬁnes and still can’t afford [health insurance], so now they’re worse off than they were.” He was right, and President Trump can give these Americans relief from fines easily by directing the IRS to ease the mandate. The two final steps the president and Republicans in Congress can take before the end of the year is to fully implement 90 percent cuts to Obamacare marketing, which would save the federal government some $90 million, and fully protect American seniors from new taxes on Medicare plans. Among the taxes going into effect next year, those enrolled in Medicare Advantage and Medicare Part D will see taxes increased nearly $3,000 each over the next decade if Congress fails to act. Time is running out, and President Trump and Republicans in Congress must act now to stop new Obamacare taxes, end the cronyism of bailouts, free Americans from burdensome federal mandates, cut wasteful ACA marketing, and protect America’s seniors. President Trump and conservatives have it within their power today to stop the most harmful aspects of the health care law, but time is short; the time to act is now. Want to protect your brain and revitalize your memory? You NEED this Super Coffee!"
    ]
}